# Add repositories
tap 'caskroom/cask'
tap 'homebrew/binary'
tap 'homebrew/brewdler'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'karan/karan'
tap 'larsimmisch/avr'
tap 'raggi/ale'
tap 'samueljohn/python'
tap 'themodernlife/misc'

# Install brew extensions
brew 'brew-cask'
brew 'brew-gem'
brew 'brew-pip'

# Core utils
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'dockutil'
brew 'gnu-sed', args: ['default-names']

# FUSE
brew 'osxfuse'
brew 'ext2fuse'
brew 'ext4fuse'

# VPN
brew 'openvpn'

# Install the latest bash
brew 'bash'
brew 'bash-completion'

# install wget with IRI support
brew 'wget'

# Install more recent versions of some OS X tools
brew 'vim', args: ['with-lua', 'HEAD']
brew 'grep'
brew 'screen'

# Other usefull binaries
brew 'ack'
brew 'ctags'
brew 'imagemagick'
brew 'nmap'
brew 'p7zip'
brew 'pigz'
brew 'webkit2png'
brew 'tree'
brew 'foremost'
brew 'chrome-cli'
brew 'chromedriver'
brew 'spark'
brew 'grc'
brew 'ffmpeg', args: ['with-faac', 'with-webp', 'with-openssl']
brew 'phantomjs'
brew 'youtube-dl'
brew 'unrar'
brew 'dnstracer'
brew 'gnupg'
brew 'htop-osx'
brew 'nmap'
brew 'ngrep'
brew 'osquery'
brew 'opencv'
brew 'pwgen'
brew 'readline'
brew 'sqlite'
brew 'tree'
brew 'x264'

# Docker tools
brew 'docker'

# Build tools
brew 'cmake'
brew 'ctags'
brew 'gcc'
brew 'llvm'
brew 'gdbm'

# Version control
brew 'cvs'
brew 'cvs2svn'
brew 'git'
brew 'git-flow'
brew 'gitignore'
brew 'mercurial'

# Config management
brew 'ansible'

# Python
brew 'python'
brew 'scipy'
brew 'numpy'
brew 'hdf5'
brew 'pip-completion'

# R
brew 'r'

# Scala, Java, Gradle
brew 'ant'
brew 'gradle'
brew 'sbt'
brew 'scala'
brew 'typesafe-activator'

# Bigdata stuff
brew 'hadoop'
brew 'lzo'
brew 'snappy'
brew 'hadoop-snappy'
brew 'hadoop-lzo'
brew 'zookeeper'
brew 'storm'
brew 'kafka'
brew 'cassandra'
brew 'elasticsearch'
brew 'redis'

# Cask apps
cask 'evernote'
cask 'vlc'
cask 'google-chrome'
cask 'google-drive'
cask 'google-notifier'
cask 'google-hangouts'
cask 'iterm2'
cask 'virtualbox'
cask 'the-unarchiver'
cask 'imageoptim'
cask 'imagealpha'
cask 'utorrent'
cask 'skype'
